app/Http/Controllers/MainController.php

    public function index ()
    {
    	//$title = 'Home page';
    	//$subtitle = '<em>My first laravel projec</em>';
        //find - метод , который делает выборку из БД по айди
        // $category = Category::find(1);
        // $products = $category->products;
        // dd($products);

        // $product = Product::find(1);
        // dd($product->category->name);

        $categories = Category::with('products')->get();
        $products = Product::with('category')->where('recommended','=',1)->get();
        $reviews = Review::latest()->limit(5)->get();
---
select * from `categories`
select * from `categories` where `categories`.`id` in (1, 2, 3)
select * from `products` where `recommended` = 1
select * from `reviews` order by `created_at` desc limit 5

    public function category (string $slug)
    {
        //return $slug;
        $category = Category::firstWhere('slug',$slug);
        //dd($category);
        $products = Product::where('category_id', $category->id)->SimplePaginate(8);
---
select * from `products` where `category_id` = 1 limit 9 offset 0

    public function product (string $slug)
    {
        $products = Product::firstWhere('slug',$slug);
        $reviews = Review::where('product_id','=',$products->id)->get();
---
select * from `reviews` where `product_id` = 15 limit 1

    public function getReview(Request $request)
    {
        $review = new Review();
        $review->review = $request->comment;
        $review->user_id = $request->user;
        $review->product_id = $request->product;
        $review->save(); //сохраняет данные модели в бд
---
insert into `reviews` (`review`, `user_id`, `product_id`, `updated_at`, `created_at`) values ('yoyo comment', '12', '1', '2020-07-23 20:44:44', '2020-07-23 20:44:44')